<h1 style='text-align: center'>SQL Queries</h1>

## Getting Data From A SQL Database

### The Structure of a SQL Query

<img src='images/sql_statement.jpg'/>

#### SELECT

- What columns of data do we want? 
- Specify by column names or * (All)

- Where are we getting our data from? 
- Specify by table name or use join statement to join multiple tables

##### JOIN

- Use to join multiple tables 
- SELECT * FROM students join favorite_foods on students.id = favorite_foods.student_id
- SELECT * FROM students as s join favorite_foods as f on s.id = f.student_id

#### WHERE

- apply some filter to the data you are querying 
- define criteria for data that should selected from the database 
- SELECT * from students WHERE age > 10

#### GROUP BY

- Group columns by similar values
- SELECT COUNT(id), city from students GROUP BY city

#### HAVING

- Use to apply filter AFTER you have made your initial query 
- When should we use HAVING instead of WHERE

In [4]:
import sqlite3

conn = sqlite3.connect('tutorial.db')
c = conn.cursor()

In [18]:
# Load students.json file

#your code here
import json
f=open('students.json','r')
data=json.load(f)

In [16]:
create_query = """CREATE TABLE IF NOT EXISTS stuffToPlot
        (unix REAL, datestamp TEXT, keyword TEXT, value REAL)"""
def create_table(query):
    c.execute(query)

In [42]:
(c.execute("""SELECT * from student_info"""))

# iterate over the data and insert each student into the DB

[]

In [50]:
def dynamic_data_entry(person):
    c.execute("""INSERT INTO student_info (name, birthdate, number_of_siblings, birth_place, years_in_nyc, favorite_food)
    VALUES (?,?,?,?,?,?)""", 
    (person['name'], person['birthdate'], person['siblings'], person['Birthplace'], person['yearsinnyc'], person['favoritefood']))
    conn.commit()

In [51]:
for student in data:
    dynamic_data_entry(student)

In [52]:
c.execute("""SELECT * FROM student_info""").fetchall()

[('Sean Abu Wilson', '02/06', 2, 'Birmingham, AL', 7.8, 'guacamole'),
 ('Sean Abu Wilson', '02/06', 2, 'Birmingham, AL', 7.8, 'guacamole'),
 ('Tawab', '04/08/1998', 4, 'Afghanistan', 0.5, 'pizza'),
 ('Bridget Boakye', '1990-07-13', 3, 'Accra', 15.0, 'Indian'),
 ('Cristina', '9/9/1990', 2, 'Spain', 6.0, 'Sushi'),
 ('Danny (Haoyang) Yu', '1997-03-19', 2, '1997-03-19', 0.0, 'Galbi'),
 ('Dustin_Breitner', '04/15/94', 2, 'New_York', 3.0, 'Pizza'),
 ('Gregory DeSantis', '1987-11-23', 2, 'Highland Park, NJ', 13.0, 'Pizza'),
 ('Harrison Miller', '10/2/85', 0, 'New Jersey', 0.0, 'Pizza'),
 ('Jeremy Owens', '03/30/1990', 0, 'Virginia', 6.0, 'Avocado'),
 ('Jeremy Reikes', '1-/12/1995', 1, 'New York City', 23.0, 'Pizza'),
 ('Johnathan Peck', '02-19-1994', 2, 'New York', 25.0, 'Moms food'),
 ('Minna F', '11-19-1996', 3, 'San Francisco', 1.0, 'sushi'),
 ('Nabil Abbas', '12-07-1994', 2, 'Long Island', 6.0, 'Gyro'),
 ('Natalie Del Rossi', '10-23-1994', 0, 'Brooklyn', 18.0, 'pizza'),
 ('Remy Canario', '10-11-1988', 0, 'New York', 28.0, 'toast'),
 ('Xristos Katsaros', '03-24-1986', 1, 'Chicago Heights, IL', 3.0, 'Pizza')]

### Questions
1. What are the names of all of the students?
2. Which student has the most siblings?
3. How many students are only children?
4. Which 3 students have lived in NYC the shortest amount of time?
5. How many students are native New Yorkers?
6. Do any two students have the same favorite food?
7. Which student was born closest to the cohort's graduation date?

In [83]:
c.execute('''SELECT * FROM student_info''').fetchall()

[('Sean Abu Wilson', '02/06', 2, 'Birmingham, AL', 7.8, 'guacamole'),
 ('Sean Abu Wilson', '02/06', 2, 'Birmingham, AL', 7.8, 'guacamole'),
 ('Tawab', '04/08/1998', 4, 'Afghanistan', 0.5, 'pizza'),
 ('Bridget Boakye', '1990-07-13', 3, 'Accra', 15.0, 'Indian'),
 ('Cristina', '9/9/1990', 2, 'Spain', 6.0, 'Sushi'),
 ('Danny (Haoyang) Yu', '1997-03-19', 2, '1997-03-19', 0.0, 'Galbi'),
 ('Dustin_Breitner', '04/15/94', 2, 'New_York', 3.0, 'Pizza'),
 ('Gregory DeSantis', '1987-11-23', 2, 'Highland Park, NJ', 13.0, 'Pizza'),
 ('Harrison Miller', '10/2/85', 0, 'New Jersey', 0.0, 'Pizza'),
 ('Jeremy Owens', '03/30/1990', 0, 'Virginia', 6.0, 'Avocado'),
 ('Jeremy Reikes', '1-/12/1995', 1, 'New York City', 23.0, 'Pizza'),
 ('Johnathan Peck', '02-19-1994', 2, 'New York', 25.0, 'Moms food'),
 ('Minna F', '11-19-1996', 3, 'San Francisco', 1.0, 'sushi'),
 ('Nabil Abbas', '12-07-1994', 2, 'Long Island', 6.0, 'Gyro'),
 ('Natalie Del Rossi', '10-23-1994', 0, 'Brooklyn', 18.0, 'pizza'),
 ('Remy Canario', '10-11-1988', 0, 'New York', 28.0, 'toast'),
 ('Xristos Katsaros', '03-24-1986', 1, 'Chicago Heights, IL', 3.0, 'Pizza')]

In [58]:
c.execute('''SELECT name from student_info GROUP BY number_of_siblings HAVING number_of_siblings = MAX(number_of_siblings)''').fetchall()

[('Harrison Miller',),
 ('Jeremy Reikes',),
 ('Sean Abu Wilson',),
 ('Bridget Boakye',),
 ('Tawab',)]

In [84]:
c.execute('''SELECT COUNT(name) from student_info WHERE number_of_siblings = 0''').fetchall()

[(4,)]

In [85]:
c.execute('''SELECT name, years_in_nyc FROM student_info ORDER BY years_in_nyc LIMIT 3''').fetchall()

[('Danny (Haoyang) Yu', 0.0), ('Harrison Miller', 0.0), ('Tawab', 0.5)]

In [67]:
c.execute('''SELECT name, birth_place FROM student_info WHERE birth_place LIKE 'New_Y%' OR birth_place = 'Brooklyn' ''').fetchall()

[('Dustin_Breitner', 'New_York'),
 ('Jeremy Reikes', 'New York City'),
 ('Johnathan Peck', 'New York'),
 ('Natalie Del Rossi', 'Brooklyn'),
 ('Remy Canario', 'New York')]

In [72]:
c.execute('''SELECT name, favorite_food FROM student_info GROUP BY favorite_food HAVING COUNT(favorite_food) > 1''').fetchall()

[('Dustin_Breitner', 'Pizza'),
 ('Sean Abu Wilson', 'guacamole'),
 ('Tawab', 'pizza')]

In [ ]:
c.execute('''SELECT name, favorite_food FROM student_info GROUP BY favorite_food HAVING COUNT(favorite_food) > 1''').fetchall()

In [94]:
c.execute('''ALTER TABLE student_info 
            ADD COLUMN dist_grad
            INSERT INTO student_info 
            VALUES CAST birthdate AS date''').fetchall()

OperationalError: near "INSERT": syntax error

In [92]:
c.execute('''SELECT DATEPART(birthdate, mm) FROM student_info''').fetchall()

OperationalError: no such column: mm

In [ ]:
def bdmd